app/views/tweets/_feed.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 34]]
---
  <h1>Replies</h1>
<% tweet.comments.each do |comment| %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
        <div class="content">
          <strong><%= User.find(comment.user_id).name %></strong>