app/views/tweets/_wtfollow.html.erb

SELECT "users".* FROM "users"
---
		<p class="panel-heading">Who to Follow</p>
	<% User.all.each do | user | %>