app/controllers/comments_controller.rb

    def new
        @tweet = Tweet.find(params[:tweet_id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]

    def set_tweet
        @tweet = Tweet.find(params[:tweet_id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]