app/controllers/likes_controller.rb

    def create
      if @likeable.likes.count >= 1 && @likeable.liked_by?(current_user)
        @like = Like.find_by(likeable_id: @likeable.id, user: current_user)
        @like.destroy
      else
        @like = @likeable.likes.new
        @like.user = current_user
        @like.save
---
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["likeable_id", 23], ["user_id", 10], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
INSERT INTO "likes" ("likeable_type", "likeable_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["likeable_type", "Tweet"], ["likeable_id", 23], ["user_id", 10], ["created_at", "2023-01-17 09:20:50.338045"], ["updated_at", "2023-01-17 09:20:50.338045"]]