app/controllers/tweets_controller.rb

UPDATE "tweets" SET "tweet" = ?, "updated_at" = ? WHERE "tweets"."id" = ?
---
  def update
    respond_to do |format|
      if @tweet.update(tweet_params)

DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 6]]
---
  def destroy
    @tweet.destroy

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tweet
      @tweet = Tweet.find(params[:id])