app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" ORDER BY created_at DESC
SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 34]]
SELECT "tweets".* FROM "tweets" ORDER BY likes_count DESC
---
  def index
    @tweets = Tweet.includes(:user).order("created_at DESC")
    @tweet = Tweet.new
    @comments = Comment.includes(:tweet)

INSERT INTO "tweets" ("tweet", "created_at", "updated_at") VALUES (?, ?, ?)  [["tweet", "ahsan is good boy"], ["created_at", "2023-01-06 13:18:03.296980"], ["updated_at", "2023-01-06 13:18:03.296980"]]
---
  def retweet
    @retweet = Retweet.new(user_id: current_user.id, tweet_id: params[:id])
    if @retweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
---
  def show
    @tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("tweet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweet", "this is a new tweeet 2"], ["created_at", "2023-01-24 09:00:13.169977"], ["updated_at", "2023-01-24 09:00:13.169977"], ["user_id", 10]]
---
  def create
    @tweet = current_user.tweets.build(tweet_params)

    respond_to do |format|
      if @tweet.save

UPDATE "tweets" SET "tweet" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["tweet", "ahsan7474"], ["updated_at", "2023-01-11 10:26:47.653133"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @tweet.update(tweet_params)

DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 10]]
---
  def destroy
    @tweet.destroy

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
---
    def set_tweet
      @tweet = Tweet.find(params[:id])